tap "1password/tap"
tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask-versions"

brew "awscli"
brew "caddy"
brew "glib"
brew "circleci"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "direnv"
brew "folly"
brew "envchain"
brew "fish"
brew "gh"
brew "git"
brew "gradle"
brew "grep"
brew "htop"
brew "jq"
brew "ktlint"
brew "lftp"
brew "libpq", link: true
brew "maven"
brew "mas"
brew "mdless"
brew "nvm"
brew "speedtest-cli"
brew "telnet"
brew "tfenv"
brew "tmux"
brew "watchman"

cask "1password-cli"
cask "docker"
cask "iterm2"
cask "notion", args: { appdir: "~/Applications" }
cask "rapidapi"
cask "slack"
cask "spotify"
cask "temurin"

mas "Amphetamine", id: 937984704        # Powerful keep-awake utility
mas "Magnet", id: 441258766             # Organize your workspace
mas "Paste", id: 967805235              # A better way to copy and paste
mas "Things", id: 904280696             # Organize your life
