tap "1password/tap"
tap "oven-sh/bun"

brew "glib"
brew "cmake"
brew "coreutils"
brew "folly"
brew "fish"
brew "gh"
brew "git"
brew "gradle"
brew "grep"
brew "htop"
brew "jq"
brew "lftp"
brew "mas"
brew "mdless"
brew "nvm"
brew "speedtest-cli"
brew "tenv"
brew "tmux"
brew "watchman"
brew "oven-sh/bun/bun"
brew "azure-cli"
brew "lazygit"
brew "fzf"

cask "1password-cli"
cask "rapidapi"
cask "slack"

mas "Amphetamine", id: 937984704        # Powerful keep-awake utility
mas "Paste", id: 967805235              # A better way to copy and paste
mas "Things", id: 904280696             # Organize your life
